# Projet 8:  Étude sur l'eau potable partie 1 

### 1 Importation des packages

In [1]:
import pandas as pd
import numpy as np
from datetime import datetime 
import scipy.stats as st
import warnings
warnings.filterwarnings("ignore")

### 2 Imporattion des fichiers csv

In [2]:
region = pd.read_csv('RegionCountry.csv')
population = pd.read_csv('Population.csv')
politicals = pd.read_csv('PoliticalStability.csv')
mortality = pd.read_csv('MortalityRateAttributedToWater.csv')
waterservice = pd.read_csv('BasicAndSafelyManagedDrinkingWaterServices.csv')

### 3 Exploration des fichiers csv

### 3.1 Région

In [3]:
region.head()

  REGION (DISPLAY) COUNTRY (DISPLAY)
0           Europe           Albania
1           Europe           Andorra
2           Europe           Armenia
3  Western Pacific         Australia
4           Europe           Austria

In [4]:
region.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 194 entries, 0 to 193
Data columns (total 2 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   REGION (DISPLAY)   194 non-null    object
 1   COUNTRY (DISPLAY)  194 non-null    object
dtypes: object(2)
memory usage: 3.2+ KB

In [5]:
region.isna().sum()

REGION (DISPLAY)     0
COUNTRY (DISPLAY)    0
dtype: int64

In [6]:
region.duplicated().sum()

0

In [7]:
region['REGION (DISPLAY)'].nunique()

6

In [8]:
region['COUNTRY (DISPLAY)'].nunique()

194

In [9]:
region.rename(columns={'REGION (DISPLAY)': 'Region', 'COUNTRY (DISPLAY)': 'Country'}, inplace=True)

In [10]:
region['Region'].unique()

array(['Europe', 'Western Pacific', 'Eastern Mediterranean',
       'South-East Asia', 'Africa', 'Americas'], dtype=object)

In [11]:
pays_Africa = region[region['Region'] == 'Africa']['Country']
pays_Africa_sorted = pays_Africa.reset_index(drop=True).sort_values(ascending=True)
print(pays_Africa_sorted)

15                             Algeria
16                              Angola
17                               Benin
0                             Botswana
18                        Burkina Faso
19                             Burundi
20                          Cabo Verde
21                            Cameroon
22            Central African Republic
23                                Chad
24                             Comoros
1                                Congo
2                        Côte d'Ivoire
25    Democratic Republic of the Congo
26                   Equatorial Guinea
27                             Eritrea
3                             Eswatini
4                             Ethiopia
28                               Gabon
5                               Gambia
6                                Ghana
29                              Guinea
30                       Guinea-Bissau
7                                Kenya
31                             Lesotho
32                             Liberia
33                          Madagascar
34                              Malawi
35                                Mali
36                          Mauritania
37                           Mauritius
38                          Mozambique
39                             Namibia
40                               Niger
8                              Nigeria
9                               Rwanda
41               Sao Tome and Principe
42                             Senegal
43                          Seychelles
10                        Sierra Leone
11                        South Africa
44                         South Sudan
45                                Togo
12                              Uganda
13         United Republic of Tanzania
14                              Zambia
46                            Zimbabwe
Name: Country, dtype: object

In [12]:
pays_Africa.count()

47

In [13]:
pays_Europe = region[region['Region'] == 'Europe']['Country']
pays_Europe_sorted = pays_Europe.reset_index(drop=True).sort_values(ascending=True)
print(pays_Europe_sorted)

0                                               Albania
1                                               Andorra
2                                               Armenia
3                                               Austria
4                                            Azerbaijan
5                                               Belarus
6                                               Belgium
7                                Bosnia and Herzegovina
8                                              Bulgaria
9                                               Croatia
10                                               Cyprus
11                                              Czechia
12                                              Denmark
13                                              Estonia
14                                              Finland
15                                               France
16                                              Georgia
17                                              Germany
18                                               Greece
19                                              Hungary
20                                              Iceland
21                                              Ireland
22                                               Israel
23                                                Italy
24                                           Kazakhstan
25                                           Kyrgyzstan
26                                               Latvia
27                                            Lithuania
28                                           Luxembourg
29                                                Malta
30                                               Monaco
31                                           Montenegro
32                                          Netherlands
34                                               Norway
35                                               Poland
36                                             Portugal
37                                  Republic of Moldova
33                          Republic of North Macedonia
38                                              Romania
39                                   Russian Federation
40                                           San Marino
41                                               Serbia
42                                             Slovakia
43                                             Slovenia
44                                                Spain
45                                               Sweden
46                                          Switzerland
47                                           Tajikistan
52                                               Turkey
48                                         Turkmenistan
49                                              Ukraine
50    United Kingdom of Great Britain and Northern I...
51                                           Uzbekistan
Name: Country, dtype: object

In [14]:
pays_Europe.count()

53

In [15]:
pays_Eastern = region[region['Region'] == 'Eastern Mediterranean']['Country']
pays_Eastern_sorted = pays_Eastern.reset_index(drop=True).sort_values(ascending=True)
print(pays_Eastern_sorted)

11                   Afghanistan
0                        Bahrain
12                      Djibouti
13                         Egypt
1     Iran (Islamic Republic of)
2                           Iraq
3                         Jordan
4                         Kuwait
5                        Lebanon
14                         Libya
6                        Morocco
7                           Oman
8                       Pakistan
9                          Qatar
15                  Saudi Arabia
16                       Somalia
17                         Sudan
18          Syrian Arab Republic
10                       Tunisia
19          United Arab Emirates
20                         Yemen
Name: Country, dtype: object

In [16]:
pays_Eastern.count()

21

In [17]:
pays_Americas = region[region['Region'] == 'Americas']['Country']
pays_Americas_sorted = pays_Americas.reset_index(drop=True).sort_values(ascending=True)
print(pays_Americas_sorted)

16                   Antigua and Barbuda
17                             Argentina
18                               Bahamas
19                              Barbados
20                                Belize
21      Bolivia (Plurinational State of)
0                                 Brazil
1                                 Canada
2                                  Chile
3                               Colombia
4                             Costa Rica
22                                  Cuba
23                              Dominica
24                    Dominican Republic
5                                Ecuador
6                            El Salvador
7                                Grenada
8                              Guatemala
25                                Guyana
26                                 Haiti
9                               Honduras
27                               Jamaica
10                                Mexico
11                             Nicaragua
28                                Panama
12                              Paraguay
13                                  Peru
29                 Saint Kitts and Nevis
30                           Saint Lucia
31      Saint Vincent and the Grenadines
32                              Suriname
33                   Trinidad and Tobago
14              United States of America
15                               Uruguay
34    Venezuela (Bolivarian Republic of)
Name: Country, dtype: object

In [18]:
pays_Americas.count()

35

In [19]:
pays_Western_Pacific = region[region['Region'] == 'Western Pacific']['Country']
pays_Western_Pacific_sorted = pays_Western_Pacific.reset_index(drop=True).sort_values(ascending=True)
print(pays_Western_Pacific_sorted)

0                            Australia
15                   Brunei Darussalam
1                             Cambodia
2                                China
16                        Cook Islands
17                                Fiji
3                                Japan
18                            Kiribati
4     Lao People's Democratic Republic
5                             Malaysia
19                    Marshall Islands
20    Micronesia (Federated States of)
6                             Mongolia
21                               Nauru
7                          New Zealand
8                                 Niue
22                               Palau
23                    Papua New Guinea
9                          Philippines
10                   Republic of Korea
11                               Samoa
12                           Singapore
24                     Solomon Islands
25                               Tonga
13                              Tuvalu
14                             Vanuatu
26                            Viet Nam
Name: Country, dtype: object

In [20]:
pays_Western_Pacific.count()

27

In [21]:
pays_Asia = region[region['Region'] == 'South-East Asia']['Country']
pays_Asia_sorted = pays_Asia.reset_index(drop=True).sort_values(ascending=True)
print(pays_Asia_sorted)

0                                Bangladesh
1                                    Bhutan
2     Democratic People's Republic of Korea
3                                     India
6                                 Indonesia
7                                  Maldives
8                                   Myanmar
4                                     Nepal
5                                 Sri Lanka
9                                  Thailand
10                              Timor-Leste
Name: Country, dtype: object

In [22]:
pays_Asia.count()

11

#### Vérification en amont sur le site de l'OMS si les pays sont bien afféctés aux régions définies par celle ci. Aucune anomalie n'a été detectée.  Toutefois, certains pays sont manquants de notre liste.

### 3.2 Population

In [23]:
population.head()

       Country Granularity  Year  Population
0  Afghanistan       Total  2000   20779.953
1  Afghanistan        Male  2000   10689.508
2  Afghanistan      Female  2000   10090.449
3  Afghanistan       Rural  2000   15657.474
4  Afghanistan       Urban  2000    4436.282

In [24]:
population.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20914 entries, 0 to 20913
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Country      20914 non-null  object
 1   Granularity  20914 non-null  object
 2   Year         20914 non-null  int64
 3   Population   20914 non-null  float64
dtypes: float64(1), int64(1), object(2)
memory usage: 653.7+ KB

In [25]:
population.isna().sum()

Country        0
Granularity    0
Year           0
Population     0
dtype: int64

In [26]:
population.duplicated().sum()

0

In [27]:
population['Country'].nunique()

239

In [28]:
population['Year'].unique()

array([2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010,
       2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018], dtype=int64)

In [29]:
# Je filtre les données de la Chine et ses provinces
donnees_chine = population.loc[population['Country'].str.contains('China', case=False)]
donnees_chine

                        Country Granularity  Year   Population
3786                      China       Total  2000  1319551.401
3787                      China        Male  2000   676800.981
3788                      China      Female  2000   642750.414
3789                      China       Rural  2000   829403.316
3790                      China       Urban  2000   482727.522
...                         ...         ...   ...          ...
4256  China, Taiwan Province of       Total  2018    23726.460
4257  China, Taiwan Province of        Male  2018    11812.166
4258  China, Taiwan Province of      Female  2018    11914.294
4259  China, Taiwan Province of       Rural  2018     5175.798
4260  China, Taiwan Province of       Urban  2018    18518.291

[475 rows x 4 columns]

In [30]:
donnees_chine['Country'].unique()

array(['China', 'China, Hong Kong SAR', 'China, Macao SAR',
       'China, mainland', 'China, Taiwan Province of'], dtype=object)

In [31]:
# Je calcule la population totale de la Chine uniquement
donnees_chine.loc[donnees_chine['Country'] == 'China', 'Population'].sum()

79126422.103

In [32]:
# Je calcule la population totale des provinces 
donnees_chine.loc[donnees_chine['Country'].isin(['China, Hong Kong SAR', 'China, Macao SAR', 'China, mainland', 'China, Taiwan Province of']), 'Population'].sum()

79126422.103

#### Le total de la population des provinces = à celui de la Chine, je supprime donc les provinces et je garde la chine uniquement, pour plus de compatibilité avec les autres df.

In [33]:
# Liste des provinces (pays) à supprimer
pays_a_supprimer = ['China, Hong Kong SAR', 'China, Macao SAR','China, mainland', 'China, Taiwan Province of']
population = population[~population['Country'].isin(pays_a_supprimer)]

In [34]:
population['Country'].nunique()

235

In [35]:
# Je filtre les données relatives au Sudan 
donnees_Sudan = population.loc[population['Country'].str.contains('Sudan', case=False)]
donnees_Sudan

              Country Granularity  Year  Population
17611     South Sudan       Total  2012   10113.649
17612     South Sudan        Male  2012    5057.131
17613     South Sudan      Female  2012    5056.517
17614     South Sudan       Rural  2012    8847.540
17615     South Sudan       Urban  2012    1970.718
...               ...         ...   ...         ...
17926  Sudan (former)       Total  2011   45180.380
17927  Sudan (former)        Male  2011   22544.682
17928  Sudan (former)      Female  2011   22635.689
17929  Sudan (former)       Rural  2011   32054.105
17930  Sudan (former)       Urban  2011   13562.066

[130 rows x 4 columns]

In [36]:
donnees_Sudan['Country'].unique()

array(['South Sudan', 'Sudan', 'Sudan (former)'], dtype=object)

In [37]:
# je renomme Sudan (former) qui = Sudan en 2011
population['Country'] = population['Country'].replace({'Sudan (former)' :'Sudan'})

In [38]:
# je renomme North Macedonia en Republic of North Macedonia 
population['Country'] = population['Country'].replace({'North Macedonia' :'Republic of North Macedonia'})

In [39]:
population['Year'].unique()

array([2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010,
       2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018], dtype=int64)

In [40]:
# Passage d'un float à integer pour la variable population
population['Population'] = (population['Population']*1000).astype(int)
population.head()

       Country Granularity  Year  Population
0  Afghanistan       Total  2000    20779953
1  Afghanistan        Male  2000    10689508
2  Afghanistan      Female  2000    10090449
3  Afghanistan       Rural  2000    15657474
4  Afghanistan       Urban  2000     4436282

In [41]:
population['Granularity'].nunique()

5

In [42]:
population['Granularity'].unique()

array(['Total', 'Male', 'Female', 'Rural', 'Urban'], dtype=object)

In [43]:
# Je crée les df population par granularité 
# pop_total
pop_total = population.loc[population['Granularity'] == 'Total',:].copy()

In [44]:
pop_total.rename(columns ={'Population': 'Pop_total'}, inplace=True)
pop_total.head()

        Country Granularity  Year  Pop_total
0   Afghanistan       Total  2000   20779953
5   Afghanistan       Total  2001   21606988
10  Afghanistan       Total  2002   22600770
15  Afghanistan       Total  2003   23680871
20  Afghanistan       Total  2004   24726684

In [45]:
del pop_total['Granularity']

In [46]:
# pop_male
pop_male = population.loc[population['Granularity'] == 'Male',:].copy()

In [47]:
pop_male.rename(columns ={'Population': 'Pop_male'}, inplace=True)
pop_male.head()

        Country Granularity  Year  Pop_male
1   Afghanistan        Male  2000  10689508
6   Afghanistan        Male  2001  11117754
11  Afghanistan        Male  2002  11642106
16  Afghanistan        Male  2003  12214634
21  Afghanistan        Male  2004  12763726

In [48]:
del pop_male['Granularity']

In [49]:
# pop_female
pop_female = population.loc[population['Granularity'] == 'Female',:].copy()

In [50]:
pop_female.rename(columns ={'Population':'Pop_female'}, inplace=True)
pop_female.head()

        Country Granularity  Year  Pop_female
2   Afghanistan      Female  2000    10090449
7   Afghanistan      Female  2001    10489238
12  Afghanistan      Female  2002    10958668
17  Afghanistan      Female  2003    11466237
22  Afghanistan      Female  2004    11962963

In [51]:
del pop_female['Granularity']

In [52]:
# pop_rural
pop_rural = population.loc[population['Granularity'] == 'Rural',:].copy()

In [53]:
pop_rural.rename(columns ={'Population':'Pop_rural'}, inplace=True)
pop_rural.head()

        Country Granularity  Year  Pop_rural
3   Afghanistan       Rural  2000   15657474
8   Afghanistan       Rural  2001   16318324
13  Afghanistan       Rural  2002   17086910
18  Afghanistan       Rural  2003   17909063
23  Afghanistan       Rural  2004   18692107

In [54]:
del pop_rural['Granularity']

In [55]:
# pop_urban
pop_urban = population.loc[population['Granularity'] == 'Urban',:].copy()

In [56]:
pop_urban.rename(columns ={'Population':'Pop_urban'}, inplace=True)
pop_urban.head()

        Country Granularity  Year  Pop_urban
4   Afghanistan       Urban  2000    4436282
9   Afghanistan       Urban  2001    4648139
14  Afghanistan       Urban  2002    4893013
19  Afghanistan       Urban  2003    5155788
24  Afghanistan       Urban  2004    5426872

In [57]:
del pop_urban['Granularity']

In [58]:
# Je joins mes 5 df pour avoir mon df final Population 
# JOINTURE 1 - Je joins le df pop_female au df pop_male 
pop_sexe = pd.merge(pop_female, pop_male, on=['Country','Year'], how='inner',  indicator= True)
pop_sexe.head()

       Country  Year  Pop_female  Pop_male _merge
0  Afghanistan  2000    10090449  10689508   both
1  Afghanistan  2001    10489238  11117754   both
2  Afghanistan  2002    10958668  11642106   both
3  Afghanistan  2003    11466237  12214634   both
4  Afghanistan  2004    11962963  12763726   both

In [59]:
pop_sexe.shape

(3752, 5)

In [60]:
# Je supprime l'indicator après analyse pour ne pas qu'il me pose problème lors de la seconde jointure
pop_sexe = pop_sexe.drop('_merge', axis=1)

In [61]:
# JOINTURE 2 - Je joins le df pop_urban au df pop_rural
pop_zone = pd.merge(pop_rural, pop_urban, on=['Country','Year'], how='inner',  indicator= True)
pop_zone.head()

       Country  Year  Pop_rural  Pop_urban _merge
0  Afghanistan  2000   15657474    4436282   both
1  Afghanistan  2001   16318324    4648139   both
2  Afghanistan  2002   17086910    4893013   both
3  Afghanistan  2003   17909063    5155788   both
4  Afghanistan  2004   18692107    5426872   both

In [62]:
# Je supprime l'indicator après analyse pour ne pas qu'il me pose problème lors de la seconde jointure
pop_zone = pop_zone.drop('_merge', axis=1)

In [63]:
pop_zone.shape

(4338, 4)

In [64]:
# JOINTURE 3 - Je joins le df pop_zone au df pop_total
data = pd.merge(pop_zone, pop_total, on=['Country','Year'], how='left',  indicator= True)
data.head()

       Country  Year  Pop_rural  Pop_urban  Pop_total _merge
0  Afghanistan  2000   15657474    4436282   20779953   both
1  Afghanistan  2001   16318324    4648139   21606988   both
2  Afghanistan  2002   17086910    4893013   22600770   both
3  Afghanistan  2003   17909063    5155788   23680871   both
4  Afghanistan  2004   18692107    5426872   24726684   both

In [65]:
data.shape

(4338, 6)

In [66]:
# Je supprime l'indicator après analyse pour ne pas qu'il me pose problème lors de la seconde jointure
data = data.drop('_merge', axis=1)

In [67]:
# JOINTURE 3 - Je joins le df data au df pop_total
population = pd.merge(data, pop_sexe, on=['Country','Year'], how='left',  indicator= True)
population.head()

,Country,Year,Pop_rural,Pop_urban,Pop_total,Pop_female,Pop_male,_merge
0,Afghanistan,2000,15657474,4436282,20779953,10090449.0,10689508.0,both
1,Afghanistan,2001,16318324,4648139,21606988,10489238.0,11117754.0,both
2,Afghanistan,2002,17086910,4893013,22600770,10958668.0,11642106.0,both
3,Afghanistan,2003,17909063,5155788,23680871,11466237.0,12214634.0,both
4,Afghanistan,2004,18692107,5426872,24726684,11962963.0,12763726.0,both

In [68]:
# Je supprime l'indicator 
population = population.drop('_merge', axis=1)

In [69]:
population.shape

(4338, 7)

### 3.3 Stabilité politique

In [70]:
politicals.head()

       Country  Year  Political_Stability Granularity
0  Afghanistan  2000                -2.44       Total
1  Afghanistan  2002                -2.04       Total
2  Afghanistan  2003                -2.20       Total
3  Afghanistan  2004                -2.30       Total
4  Afghanistan  2005                -2.07       Total

In [71]:
politicals.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3526 entries, 0 to 3525
Data columns (total 4 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Country              3526 non-null   object
 1   Year                 3526 non-null   int64
 2   Political_Stability  3526 non-null   float64
 3   Granularity          3526 non-null   object
dtypes: float64(1), int64(1), object(2)
memory usage: 110.3+ KB

In [72]:
politicals.isna().sum()

Country                0
Year                   0
Political_Stability    0
Granularity            0
dtype: int64

In [73]:
politicals.duplicated().sum()

0

In [74]:
politicals['Year'].nunique()

18

In [75]:
politicals['Country'].nunique()

200

In [76]:
politicals['Country'].unique()

array(['Afghanistan', 'Albania', 'Algeria', 'American Samoa', 'Andorra',
       'Angola', 'Antigua and Barbuda', 'Argentina', 'Armenia',
       'Australia', 'Austria', 'Azerbaijan', 'Bahamas', 'Bahrain',
       'Bangladesh', 'Barbados', 'Belarus', 'Belgium', 'Belize', 'Benin',
       'Bermuda', 'Bhutan', 'Bolivia (Plurinational State of)',
       'Bosnia and Herzegovina', 'Botswana', 'Brazil',
       'Brunei Darussalam', 'Bulgaria', 'Burkina Faso', 'Burundi',
       'Cabo Verde', 'Cambodia', 'Cameroon', 'Canada',
       'Central African Republic', 'Chad', 'Chile',
       'China, Hong Kong SAR', 'China, Macao SAR', 'China, mainland',
       'China, Taiwan Province of', 'Colombia', 'Comoros', 'Congo',
       'Cook Islands', 'Costa Rica', "Côte d'Ivoire", 'Croatia', 'Cuba',
       'Cyprus', 'Czechia', "Democratic People's Republic of Korea",
       'Democratic Republic of the Congo', 'Denmark', 'Djibouti',
       'Dominica', 'Dominican Republic', 'Ecuador', 'Egypt',
       'El Salvador', 'Equatorial Guinea', 'Eritrea', 'Estonia',
       'Eswatini', 'Ethiopia', 'Fiji', 'Finland', 'France', 'Gabon',
       'Gambia', 'Georgia', 'Germany', 'Ghana', 'Greece', 'Greenland',
       'Grenada', 'Guatemala', 'Guinea', 'Guinea-Bissau', 'Guyana',
       'Haiti', 'Honduras', 'Hungary', 'Iceland', 'India', 'Indonesia',
       'Iran (Islamic Republic of)', 'Iraq', 'Ireland', 'Israel', 'Italy',
       'Jamaica', 'Japan', 'Jordan', 'Kazakhstan', 'Kenya', 'Kiribati',
       'Kuwait', 'Kyrgyzstan', "Lao People's Democratic Republic",
       'Latvia', 'Lebanon', 'Lesotho', 'Liberia', 'Libya', 'Lithuania',
       'Luxembourg', 'Madagascar', 'Malawi', 'Malaysia', 'Maldives',
       'Mali', 'Malta', 'Marshall Islands', 'Mauritania', 'Mauritius',
       'Mexico', 'Micronesia (Federated States of)', 'Mongolia',
       'Montenegro', 'Morocco', 'Mozambique', 'Myanmar', 'Namibia',
       'Nauru', 'Nepal', 'Netherlands', 'New Zealand', 'Nicaragua',
       'Niger', 'Nigeria', 'Niue', 'North Macedonia', 'Norway', 'Oman',
       'Pakistan', 'Palau', 'Palestine', 'Panama', 'Papua New Guinea',
       'Paraguay', 'Peru', 'Philippines', 'Poland', 'Portugal',
       'Puerto Rico', 'Qatar', 'Republic of Korea', 'Republic of Moldova',
       'Romania', 'Russian Federation', 'Rwanda', 'Saint Kitts and Nevis',
       'Saint Lucia', 'Saint Vincent and the Grenadines', 'Samoa',
       'Sao Tome and Principe', 'Saudi Arabia', 'Senegal', 'Serbia',
       'Seychelles', 'Sierra Leone', 'Singapore', 'Slovakia', 'Slovenia',
       'Solomon Islands', 'Somalia', 'South Africa', 'South Sudan',
       'Spain', 'Sri Lanka', 'Sudan', 'Suriname', 'Sweden', 'Switzerland',
       'Syrian Arab Republic', 'Tajikistan', 'Thailand', 'Timor-Leste',
       'Togo', 'Tonga', 'Trinidad and Tobago', 'Tunisia', 'Turkey',
       'Turkmenistan', 'Tuvalu', 'Uganda', 'Ukraine',
       'United Arab Emirates',
       'United Kingdom of Great Britain and Northern Ireland',
       'United Republic of Tanzania', 'United States of America',
       'Uruguay', 'Uzbekistan', 'Vanuatu',
       'Venezuela (Bolivarian Republic of)', 'Viet Nam', 'Yemen',
       'Zambia', 'Zimbabwe'], dtype=object)

In [77]:
politicals['Granularity'].nunique()

1

In [78]:
del politicals['Granularity']

In [79]:
politicals['Year'].unique()

array([2000, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011,
       2012, 2013, 2014, 2015, 2016, 2017, 2018], dtype=int64)

In [80]:
politicals['Political_Stability'].describe()

count    3526.000000
mean       -0.051044
std         0.996039
min        -3.310000
25%        -0.710000
50%         0.050000
75%         0.797500
max         1.970000
Name: Political_Stability, dtype: float64

In [81]:
# Je remplace North Macedonia par Republic of North Macedonia
politicals['Country'] = politicals['Country'].replace({'North Macedonia' :'Republic of North Macedonia'})

In [82]:
# Je filtre les données de la Chine et ses provinces
politicals_chine = politicals.loc[politicals['Country'].str.contains('China', case=False)]
politicals_chine

                       Country  Year  Political_Stability
663       China, Hong Kong SAR  2000                 0.93
664       China, Hong Kong SAR  2002                 0.91
665       China, Hong Kong SAR  2003                 0.95
666       China, Hong Kong SAR  2004                 1.15
667       China, Hong Kong SAR  2005                 1.34
..                         ...   ...                  ...
730  China, Taiwan Province of  2014                 0.77
731  China, Taiwan Province of  2015                 0.92
732  China, Taiwan Province of  2016                 0.93
733  China, Taiwan Province of  2017                 0.86
734  China, Taiwan Province of  2018                 0.85

[72 rows x 3 columns]

In [83]:
politicals_chine.nunique()

Country                 4
Year                   18
Political_Stability    57
dtype: int64

In [84]:
# Je groupe les données par année et je calcule la moyenne de la stabilité politique
mean_stability = politicals_chine.groupby('Year')['Political_Stability'].mean()
mean_stability

Year
2000    0.4375
2002    0.4575
2003    0.5375
2004    0.6800
2005    0.7000
2006    0.5750
2007    0.4025
2008    0.4900
2009    0.4250
2010    0.4275
2011    0.4775
2012    0.4975
2013    0.5025
2014    0.6525
2015    0.6550
2016    0.6500
2017    0.7225
2018    0.6600
Name: Political_Stability, dtype: float64

In [85]:
# Je crée le df China pour supprimer les provences 
China = pd.DataFrame({'Country':['China','China','China','China','China','China','China','China','China','China','China','China','China','China','China','China','China','China'],
                      'Year':[2000,2002,2003,2004,2005,2006,2007,2008,2009,2010,2011,2012,2013,2014,2015,2016,2017,2018],
                      'Political_Stability':[0.4375,0.4575,0.5375,0.6800,0.7000,0.5750,0.4025,0.4900,0.4250,0.4275,0.4775,0.4975,0.5025,0.6525,0.6550,0.6500,0.7225,0.6600]
                     })

In [86]:
China.head()

  Country  Year  Political_Stability
0   China  2000               0.4375
1   China  2002               0.4575
2   China  2003               0.5375
3   China  2004               0.6800
4   China  2005               0.7000

In [87]:
# J'ajoute le df China et au df politicals pour obtenir le df final de la stabilité politique
stability = pd.concat([politicals, China], ignore_index=True)
stability.head()

       Country  Year  Political_Stability
0  Afghanistan  2000                -2.44
1  Afghanistan  2002                -2.04
2  Afghanistan  2003                -2.20
3  Afghanistan  2004                -2.30
4  Afghanistan  2005                -2.07

In [88]:
# J'utilise la liste des pays à supprimer créee ci-dessus
stability = stability[~stability['Country'].isin(pays_a_supprimer)]

In [89]:
stability['Country'].nunique()

197

### 3.4 Mortalité

In [90]:
mortality.head(10)

,Year,Country,Granularity,Mortality rate attributed to exposure to unsafe WASH services,WASH deaths
0,2016,Afghanistan,Female,15.31193,NaN
1,2016,Afghanistan,Male,12.61297,NaN
2,2016,Afghanistan,Total,13.92067,4824.35300
3,2016,Albania,Female,0.12552,NaN
4,2016,Albania,Male,0.20650,NaN
5,2016,Albania,Total,0.16641,4.86975
6,2016,Algeria,Female,2.19890,NaN
7,2016,Algeria,Male,1.72837,NaN
8,2016,Algeria,Total,1.86723,758.21000
9,2016,Angola,Female,45.15024,NaN

In [91]:
mortality.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 549 entries, 0 to 548
Data columns (total 5 columns):
 #   Column                                                         Non-Null Count  Dtype
---  ------                                                         --------------  -----
 0   Year                                                           549 non-null    int64
 1   Country                                                        549 non-null    object
 2   Granularity                                                    549 non-null    object
 3   Mortality rate attributed to exposure to unsafe WASH services  549 non-null    float64
 4   WASH deaths                                                    183 non-null    float64
dtypes: float64(2), int64(1), object(2)
memory usage: 21.6+ KB

In [92]:
mortality.duplicated().sum()

0

In [93]:
mortality.isna().sum()

Year                                                               0
Country                                                            0
Granularity                                                        0
Mortality rate attributed to exposure to unsafe WASH services      0
WASH deaths                                                      366
dtype: int64

In [94]:
mortality['WASH deaths'] = mortality['WASH deaths'].fillna(0) 
# Les 0 à ne pas commenter

In [95]:
mortality['Country'].nunique()

183

In [96]:
mortality['Year'].nunique()

1

In [97]:
mortality['Granularity'].nunique()

3

In [98]:
# Je crée les df mortality par granularité 
# je crée le df mortality total
morta_total = mortality.loc[mortality['Granularity'] == 'Total',:].copy()

In [99]:
morta_total.rename(columns ={'Mortality rate attributed to exposure to unsafe WASH services':' Total mortality rate per 100000 pop',
                            'WASH deaths': 'Total wash deaths'}, inplace=True)
morta_total.head()

,Year,Country,Granularity,Total mortality rate per 100000 pop,Total wash deaths
2,2016,Afghanistan,Total,13.92067,4824.35300
5,2016,Albania,Total,0.16641,4.86975
8,2016,Algeria,Total,1.86723,758.21000
11,2016,Angola,Total,48.81467,14065.20000
14,2016,Antigua and Barbuda,Total,0.11403,0.11513

In [100]:
del morta_total['Granularity']

In [101]:
# je crée le df mortality female
morta_female = mortality.loc[mortality['Granularity'] == 'Female',:].copy()

In [102]:
morta_female.rename(columns ={'Mortality rate attributed to exposure to unsafe WASH services':'Female mortality rate per 100000 pop',
                            'WASH deaths':'Female wash deaths '}, inplace=True)
morta_female.head()

,Year,Country,Granularity,Female mortality rate per 100000 pop,Female wash deaths
0,2016,Afghanistan,Female,15.31193,0.0
3,2016,Albania,Female,0.12552,0.0
6,2016,Algeria,Female,2.19890,0.0
9,2016,Angola,Female,45.15024,0.0
12,2016,Antigua and Barbuda,Female,0.10419,0.0

In [103]:
del morta_female['Granularity']

In [104]:
# je crée le df mortality male
morta_male = mortality.loc[mortality['Granularity'] == 'Male',:].copy()

In [105]:
morta_male.rename(columns ={'Mortality rate attributed to exposure to unsafe WASH services':'Male mortality rate per 100000 pop',
                            'WASH deaths':'Male wash deaths '}, inplace=True)
morta_male.head()

,Year,Country,Granularity,Male mortality rate per 100000 pop,Male wash deaths
1,2016,Afghanistan,Male,12.61297,0.0
4,2016,Albania,Male,0.20650,0.0
7,2016,Algeria,Male,1.72837,0.0
10,2016,Angola,Male,52.62506,0.0
13,2016,Antigua and Barbuda,Male,0.12469,0.0

In [106]:
del morta_male['Granularity']

In [107]:
# Je joins mes 3 df pour avoir mon df motality final
# JOINTURE 1 - Je joins le df mortal_female au df morta_male 
morta_s = pd.merge(morta_female, morta_male, on=['Country', 'Year'], how='inner',  indicator= True)
morta_s.head()

,Year,Country,Female mortality rate per 100000 pop,Female wash deaths,Male mortality rate per 100000 pop,Male wash deaths,_merge
0,2016,Afghanistan,15.31193,0.0,12.61297,0.0,both
1,2016,Albania,0.12552,0.0,0.20650,0.0,both
2,2016,Algeria,2.19890,0.0,1.72837,0.0,both
3,2016,Angola,45.15024,0.0,52.62506,0.0,both
4,2016,Antigua and Barbuda,0.10419,0.0,0.12469,0.0,both

In [108]:
# Je supprime l'indicator après analyse pour ne pas qu'il me pose problème lors de la seconde jointure
morta_s = morta_s.drop('_merge', axis=1)

In [109]:
morta_s = morta_s.drop(columns=['Male wash deaths ', 'Female wash deaths '])

In [110]:
# JOINTURE 2 - Je joins le df morta_s au df morta_totale
mortality = pd.merge(morta_s, morta_total, on=['Country','Year'], how='inner',  indicator= True)
mortality.head()

,Year,Country,Female mortality rate per 100000 pop,Male mortality rate per 100000 pop,Total mortality rate per 100000 pop,Total wash deaths,_merge
0,2016,Afghanistan,15.31193,12.61297,13.92067,4824.35300,both
1,2016,Albania,0.12552,0.20650,0.16641,4.86975,both
2,2016,Algeria,2.19890,1.72837,1.86723,758.21000,both
3,2016,Angola,45.15024,52.62506,48.81467,14065.20000,both
4,2016,Antigua and Barbuda,0.10419,0.12469,0.11403,0.11513,both

In [111]:
# Je supprime l'indicator 
mortality = mortality.drop('_merge', axis=1)

In [112]:
mortality.shape

(183, 6)

### 3.5 Waterservice

In [113]:
waterservice.head(10)

,Year,Country,Granularity,Population using at least basic drinking-water services (%),Population using safely managed drinking-water services (%)
0,2000,Afghanistan,Rural,21.61913,NaN
1,2000,Afghanistan,Total,27.77190,NaN
2,2000,Afghanistan,Urban,49.48745,NaN
3,2000,Albania,Rural,81.78472,NaN
4,2000,Albania,Total,87.86662,49.29324
5,2000,Albania,Urban,96.35529,NaN
6,2000,Algeria,Rural,83.32201,NaN
7,2000,Algeria,Total,89.83726,NaN
8,2000,Algeria,Urban,94.19543,NaN
9,2000,Andorra,Rural,100.00000,NaN

In [114]:
waterservice.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10476 entries, 0 to 10475
Data columns (total 5 columns):
 #   Column                                                       Non-Null Count  Dtype
---  ------                                                       --------------  -----
 0   Year                                                         10476 non-null  int64
 1   Country                                                      10476 non-null  object
 2   Granularity                                                  10476 non-null  object
 3   Population using at least basic drinking-water services (%)  9415 non-null   float64
 4   Population using safely managed drinking-water services (%)  3286 non-null   float64
dtypes: float64(2), int64(1), object(2)
memory usage: 409.3+ KB

In [115]:
waterservice.duplicated().sum()

0

In [116]:
waterservice['Country'].nunique()

194

In [117]:
waterservice['Year'].unique()

array([2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010,
       2011, 2012, 2013, 2014, 2015, 2016, 2017], dtype=int64)

In [118]:
# je renomme les variables 
waterservice.rename(columns={'Population using at least basic drinking-water services (%)':
                             'Basic Water Services (% Pop)', 
                             'Population using safely managed drinking-water services (%)': 
                             'Safe Drinking Water (% Pop)'}, inplace=True)
# % de la population qui a accès à des services d'eau potable de base
# accès minimal à l'eau potable, ce qui peut inclure des sources d'eau améliorées comme les réseaux d'eau courante

In [119]:
# J'affice les variables avec les NAN
waterservice.isna().sum()

Year                               0
Country                            0
Granularity                        0
Basic Water Services (% Pop)    1061
Safe Drinking Water (% Pop)     7190
dtype: int64

In [120]:
# Je remplace les NAN par 0
waterservice['Basic Water Services (% Pop)'] = waterservice['Basic Water Services (% Pop)'].fillna(0)
waterservice['Safe Drinking Water (% Pop)'] = waterservice['Safe Drinking Water (% Pop)'].fillna(0)
# 0 à ne pas commenter car risque de fauser l'analyse

In [121]:
# Je crée les df waterservice par granularity
# je crée le df waterservice totla
water_total = waterservice.loc[waterservice['Granularity'] == 'Total',:].copy()

In [122]:
water_total.rename(columns ={'Basic Water Services (% Pop)':'Total basic Water Services (% Pop)',
                            'Safe Drinking Water (% Pop)':'Total safe Drinking Water (% Pop) '}, inplace=True)
water_total.head()

,Year,Country,Granularity,Total basic Water Services (% Pop),Total safe Drinking Water (% Pop)
1,2000,Afghanistan,Total,27.77190,0.00000
4,2000,Albania,Total,87.86662,49.29324
7,2000,Algeria,Total,89.83726,0.00000
10,2000,Andorra,Total,100.00000,90.64000
13,2000,Angola,Total,41.14431,0.00000

In [123]:
del water_total['Granularity']

In [124]:
# je crée le df waterservice Urban
water_urban = waterservice.loc[waterservice['Granularity'] == 'Urban',:].copy()

In [125]:
water_urban.rename(columns ={'Basic Water Services (% Pop)':'Urban basic Water Services (% Pop)',
                            'Safe Drinking Water (% Pop)':'Urban safe Drinking Water (% Pop) '}, inplace=True)
water_urban.head()

,Year,Country,Granularity,Urban basic Water Services (% Pop),Urban safe Drinking Water (% Pop)
2,2000,Afghanistan,Urban,49.48745,0.0
5,2000,Albania,Urban,96.35529,0.0
8,2000,Algeria,Urban,94.19543,0.0
11,2000,Andorra,Urban,100.00000,0.0
14,2000,Angola,Urban,61.06653,0.0

In [126]:
del water_urban['Granularity']

In [127]:
# je crée le df waterservice Rural
water_rural = waterservice.loc[waterservice['Granularity'] == 'Rural',:].copy()

In [128]:
water_rural.rename(columns ={'Basic Water Services (% Pop)':'Rural basic Water Services (% Pop)',
                            'Safe Drinking Water (% Pop)':'Rural safe Drinking Water (% Pop) '}, inplace=True)
water_rural.head()

,Year,Country,Granularity,Rural basic Water Services (% Pop),Rural safe Drinking Water (% Pop)
0,2000,Afghanistan,Rural,21.61913,0.0
3,2000,Albania,Rural,81.78472,0.0
6,2000,Algeria,Rural,83.32201,0.0
9,2000,Andorra,Rural,100.00000,0.0
12,2000,Angola,Rural,21.15264,0.0

In [129]:
del water_rural['Granularity']

In [130]:
# Je join les 3 df pour avoir mon df final waterservice
# JOINTURE 1 - Je joins le df pop_urban au df pop_rural
water_zone = pd.merge(water_rural, water_urban, on=['Country','Year'], how='inner',  indicator= True)
water_zone.head()

,Year,Country,Rural basic Water Services (% Pop),Rural safe Drinking Water (% Pop),Urban basic Water Services (% Pop),Urban safe Drinking Water (% Pop),_merge
0,2000,Afghanistan,21.61913,0.0,49.48745,0.0,both
1,2000,Albania,81.78472,0.0,96.35529,0.0,both
2,2000,Algeria,83.32201,0.0,94.19543,0.0,both
3,2000,Andorra,100.00000,0.0,100.00000,0.0,both
4,2000,Angola,21.15264,0.0,61.06653,0.0,both

In [131]:
# Je supprime l'indicator après analyse pour ne pas qu'il me pose problème lors de la seconde jointure
water_zone = water_zone.drop('_merge', axis=1)

In [132]:
# JOINTURE 2 - Je joins le df water_zone au df water_total
waterservice = pd.merge(water_zone, water_total, on=['Country','Year'], how='inner',  indicator= True)
waterservice.head()

,Year,Country,Rural basic Water Services (% Pop),Rural safe Drinking Water (% Pop),Urban basic Water Services (% Pop),Urban safe Drinking Water (% Pop),Total basic Water Services (% Pop),Total safe Drinking Water (% Pop),_merge
0,2000,Afghanistan,21.61913,0.0,49.48745,0.0,27.77190,0.00000,both
1,2000,Albania,81.78472,0.0,96.35529,0.0,87.86662,49.29324,both
2,2000,Algeria,83.32201,0.0,94.19543,0.0,89.83726,0.00000,both
3,2000,Andorra,100.00000,0.0,100.00000,0.0,100.00000,90.64000,both
4,2000,Angola,21.15264,0.0,61.06653,0.0,41.14431,0.00000,both

In [133]:
# Je supprime l'indicator 
waterservice = waterservice.drop('_merge', axis=1)

In [134]:
waterservice.shape

(3492, 8)

### 4 Jointure des DataFrame

In [135]:
# JOINTURE 1 - Je joins le df popu au df waterservice en utilsant comme clé de jointure 'Country'   
pop_water = pd.merge(population, waterservice, on=['Country','Year'], how='outer', indicator= True)
pop_water.head()

,Country,Year,Pop_rural,Pop_urban,Pop_total,Pop_female,Pop_male,Rural basic Water Services (% Pop),Rural safe Drinking Water (% Pop),Urban basic Water Services (% Pop),Urban safe Drinking Water (% Pop),Total basic Water Services (% Pop),Total safe Drinking Water (% Pop),_merge
0,Afghanistan,2000,15657474.0,4436282.0,20779953.0,10090449.0,10689508.0,21.61913,0.0,49.48745,0.0,27.77190,0.0,both
1,Afghanistan,2001,16318324.0,4648139.0,21606988.0,10489238.0,11117754.0,21.61913,0.0,49.48745,0.0,27.79726,0.0,both
2,Afghanistan,2002,17086910.0,4893013.0,22600770.0,10958668.0,11642106.0,23.59988,0.0,51.90447,0.0,29.90076,0.0,both
3,Afghanistan,2003,17909063.0,5155788.0,23680871.0,11466237.0,12214634.0,25.58063,0.0,54.32149,0.0,32.00507,0.0,both
4,Afghanistan,2004,18692107.0,5426872.0,24726684.0,11962963.0,12763726.0,27.56138,0.0,56.73851,0.0,34.12623,0.0,both

In [136]:
# Je supprime l'indicator après analyse pour ne pas qu'il me pose problème lors de la seconde jointure
pop_water = pop_water.drop('_merge', axis=1)

In [137]:
pop_water.shape

(4362, 13)

In [138]:
# JOINTURE 2 - Je joins le df popu_sta au df waterservice en utilsant comme clé de jointure 'Country'   
pop_water_stabi = pd.merge(pop_water, stability, on=['Country','Year'], how='outer',  indicator= True)
pop_water_stabi.head()

,Country,Year,Pop_rural,Pop_urban,Pop_total,Pop_female,Pop_male,Rural basic Water Services (% Pop),Rural safe Drinking Water (% Pop),Urban basic Water Services (% Pop),Urban safe Drinking Water (% Pop),Total basic Water Services (% Pop),Total safe Drinking Water (% Pop),Political_Stability,_merge
0,Afghanistan,2000,15657474.0,4436282.0,20779953.0,10090449.0,10689508.0,21.61913,0.0,49.48745,0.0,27.77190,0.0,-2.44,both
1,Afghanistan,2001,16318324.0,4648139.0,21606988.0,10489238.0,11117754.0,21.61913,0.0,49.48745,0.0,27.79726,0.0,NaN,left_only
2,Afghanistan,2002,17086910.0,4893013.0,22600770.0,10958668.0,11642106.0,23.59988,0.0,51.90447,0.0,29.90076,0.0,-2.04,both
3,Afghanistan,2003,17909063.0,5155788.0,23680871.0,11466237.0,12214634.0,25.58063,0.0,54.32149,0.0,32.00507,0.0,-2.20,both
4,Afghanistan,2004,18692107.0,5426872.0,24726684.0,11962963.0,12763726.0,27.56138,0.0,56.73851,0.0,34.12623,0.0,-2.30,both

In [139]:
# Je supprime l'indicator après analyse pour ne pas qu'il me pose problème lors de la seconde jointure
pop_water_stabi = pop_water_stabi.drop('_merge', axis=1)

In [140]:
pop_water_stabi.shape

(4362, 14)

In [141]:
# JOINTURE 3  Je joins le df pop_sta_water au df mortality en utilsant comme clé de jointure 'Country' 
df = pd.merge(pop_water_stabi, mortality, on=['Country', 'Year'], how='left',  indicator= True)
df.head()

,Country,Year,Pop_rural,Pop_urban,Pop_total,Pop_female,Pop_male,Rural basic Water Services (% Pop),Rural safe Drinking Water (% Pop),Urban basic Water Services (% Pop),Urban safe Drinking Water (% Pop),Total basic Water Services (% Pop),Total safe Drinking Water (% Pop),Political_Stability,Female mortality rate per 100000 pop,Male mortality rate per 100000 pop,Total mortality rate per 100000 pop,Total wash deaths,_merge
0,Afghanistan,2000,15657474.0,4436282.0,20779953.0,10090449.0,10689508.0,21.61913,0.0,49.48745,0.0,27.77190,0.0,-2.44,NaN,NaN,NaN,NaN,left_only
1,Afghanistan,2001,16318324.0,4648139.0,21606988.0,10489238.0,11117754.0,21.61913,0.0,49.48745,0.0,27.79726,0.0,NaN,NaN,NaN,NaN,NaN,left_only
2,Afghanistan,2002,17086910.0,4893013.0,22600770.0,10958668.0,11642106.0,23.59988,0.0,51.90447,0.0,29.90076,0.0,-2.04,NaN,NaN,NaN,NaN,left_only
3,Afghanistan,2003,17909063.0,5155788.0,23680871.0,11466237.0,12214634.0,25.58063,0.0,54.32149,0.0,32.00507,0.0,-2.20,NaN,NaN,NaN,NaN,left_only
4,Afghanistan,2004,18692107.0,5426872.0,24726684.0,11962963.0,12763726.0,27.56138,0.0,56.73851,0.0,34.12623,0.0,-2.30,NaN,NaN,NaN,NaN,left_only

In [142]:
# J'affiche combien d'individus ont matché 
df['_merge'].value_counts()

left_only     4179
both           183
right_only       0
Name: _merge, dtype: int64

In [143]:
# Je supprime l'indicator après analyse pour ne pas qu'il me pose problème lors de la seconde jointure
df = df.drop('_merge', axis=1)

In [144]:
# Je convertis 'Year' en type date
df['Year'] = pd.to_datetime(df['Year'], format='%Y')

In [145]:
df.shape

(4362, 18)

In [146]:
# Je sauvgarde mon df en tant que fichies csv 
df.to_csv('C:\\Users\\halim\\OneDrive\\Bureau\\Projet_8\\csv.file.nettoye8.csv', index=False)

In [147]:
region.to_csv('C:\\Users\\halim\\OneDrive\\Bureau\\Projet_8\\csv.reg.nettoye8.csv', index=False)

In [148]:
# df region à joindre au df final sur tableau (jointure interne)